#ifndef __LOCK_H__/*LYF_2014_01_15*/
#define __LOCK_H__


//////////////////////////////////////////////////////////////////////////////
//Èç¹û´òËãÊ¹ÓÃ¾²Ì¬¿â£¬ÇëÐèÒªÌí¼ÓÔ¤±àÒë´¦Àí¶¨Òå __LOCK_STATIC 
//#define __LOCK_STATIC

#ifdef __LOCK_STATIC

#define LYFEXP
#define In			 	// ÊäÈë²ÎÊý
#define Out			 	// Êä³ö²ÎÊý

#else

#ifdef CDLL8_EXPORTS
#define LYFEXP		__declspec(dllexport)
#else
#define LYFEXP		__declspec(dllimport)
#endif // CDLL8_EXPORTS

#define In			 	// ÊäÈë²ÎÊý
#define Out			 	// Êä³ö²ÎÊý

#endif

#define CALLAPI __stdcall

#ifdef __cplusplus
extern "C"{
#endif

#ifndef LIMIT_TYPE_COUNT
#define LIMIT_TYPE_COUNT				1			// ÆÚÏÞÀàÐÍÎª¼Æ´Î
#endif
#ifndef LIMIT_TYPE_LENGTH
#define LIMIT_TYPE_LENGTH				2			// ÆÚÏÞÀàÐÍÊ±¼ä³¤¶È
#endif
#ifndef LIMIT_TYPE_QUANTUM
#define LIMIT_TYPE_QUANTUM				3			// ÆÚÏÞÀàÐÍÎªÊ±¼ä¶Î
#endif

	enum SET_LOCK_TYPE {
		LOCK_GET_REMAIN_TIME_CNT = 0, // read the reamin limit time/count
		LOCK_SET_LIMIT_CNT = 1,		// set the limit count
		LOCK_SET_LIMIT_TIME = 2,	// set limit time in minutes
		LOCK_SET_LIMIT_ABS_TIME = 3,	// set limit absolute time
		LOCK_REMOVE_TIME_LIMIT = 4,		// remove or reset time limit
		LOCK_SET_LIMIT_TYPE = 5,		// set the kind of limitation
		LOCK_GET_LIMIT_TYPE = 6,		// get the kind of limit
		LOCK_SET_MANAGE_PWD = 7,		// set manage password
		LOCK_GET_DOG_SERIAL = 8			// get serial number of serial
	};
	///////////////////////////////////////////////////////////////////////////////



	///////////////////////////////////////////////////////////////////////////////
	//LOCK.H
	///////////////////////////////////////////////////////////////////////////////
	/************************************************************************/
	/* Led_On,ÉèÖÃÒ»¸öLedµÄÁÁÃðÖÜÆÚÖÐ£¬LedµÆµãÁÁµÄÊ±¼ä£¬µ¥Î»Îª50ms				*/
	/* Led_Time, ÉèÖÃÒ»¸öLedµÆµÄÁÁÃðÖÜÆÚ£¬µ¥Î»Îª50ms							*/
	/* ËµÃ÷£ºLed_On²»ÄÜ´óÓÚLed_Time,·ñÔò»á·µ»Ø²ÎÊý´íÎó							*/
	/* Led_On¿ÉÒÔµÈÓÚLed_Time,´ËÊ±£¬µÆ³£ÁÁ										*/
	/* flagÎª0Ê±£¬ºöÂÔÃÜÂë£¬´ËÊ±password²ÎÊý±ØÐëÎª¿Õ£¬							*/
	/*            º¯Êýµ÷ÓÃ³É¹¦»áÁÙÊ±¸Ä±äLedµÄÁÁÃðÖÜÆÚ							*/
	/* flagÎª1Ê±£¬»áÑéÖ¤ÃÜÂë£¬													*/
	/*            ÈôÃÜÂë´íÎó£¬»áÉèÖÃÊ§°Ü										*/
	/*			  ÈôÃÜÂëÑéÖ¤Íê³É£¬»áÓÀ¾Ã¸Ä±äLedµÆµÄÁÁÃðÖÜÆÚ						*/
	/************************************************************************/
	LYFEXP BOOL CALLAPI SetLedTime(In unsigned short Led_on , 
		In unsigned short Led_Time, 
		In unsigned char flag, 
		In const char* password, 
		In unsigned long uSerial,
		In unsigned long uMini);


	LYFEXP	BOOL CALLAPI GetSn(unsigned long* pSn,unsigned long* pulCount);
	/************************************************************************
	***¹¦ÄÜËµÃ÷£º
	***		´Ëº¯ÊýÓÃÓÚ»ñµÃ»úÆ÷ÉÏµÄ¼ÓÃÜËøµÄÐòÁÐºÅ,¿ÉÔÚInitiateLockÖ®Ç°Ê¹ÓÃ
	***²ÎÊýËµÃ÷£º
	***		pSn£ºÖ¸Ïò»ñÈ¡ÐòÁÐºÅµÄULONGÊý×é;
	***		pulCount£ºpSnÊý×éµÄ´óÐ¡;
	***		µ±pSn == NULLÊ±, Èç¹ûº¯Êý³É¹¦,pulCount·µ»Ø´æ·ÅÐòÁÐºÅÊ±£¬pSnÊý×éÐèÒªµÄ´óÐ¡;
	***		µ±pSn != NULLÊ±, Èç¹ûº¯ÊýÊ§°Ü£¬ÇÒ·µ»Ø LYF_BUFFER_TOO_SMALL,±íÊ¾pSn¹ýÐ¡£¬pulCount·µ»ØpSnÐèÒªµÄÊý×é´óÐ¡;
	***						 Èç¹ûº¯Êý³É¹¦£¬pSn»ñµÃ»úÆ÷ÉÏ´æÔÚµÄ¼ÓÃÜËøÐòÁÐºÅµÄÊý×é;
	***·µ»ØÖµ£º
	***		·µ»ØÖµÎªTRUEÊ±±íÊ¾º¯ÊýÖ´ÐÐ³É¹¦£¬·ñÔò²Î¿¼´íÎóÁÐ±í¡£Ê¹ÓÃLYFGetLastError()»ñÈ¡´íÎóºÅ
	************************************************************************/

	LYFEXP  BOOL CALLAPI InitiateLock(unsigned long uSerial);
	/*
	*** ¹¦ÄÜËµÃ÷£º
	***		´Ëº¯ÊýÊÇ¼ÓÃÜËøµÄ³õÊ¼»¯º¯Êý£¬µ÷ÓÃÈÎºÎÆäËûº¯ÊýÇ°ÇëÎñ±ØÏÈµ÷ÓÃ´Ëº¯Êý½øÐÐ³õÊ¼»¯¹¤×÷¡£
	***
	*** ²ÎÊýËµÃ÷£º
	***		uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆµÄÉè±¸¡£
	***
	*** ·µ»ØÖµ£º
	***		¸Ãº¯ÊýµÄ·µ»ØÖµÈç¹ûÎªTRUEÔòº¯Êý³É¹¦Ö´ÐÐ£¬Èç¹ûÎªFALSE£¬Ôò²Î¿¼´íÎóºÅÁÐ±í¡£Ê¹ÓÃLYFGetLastError()»ñÈ¡´íÎóºÅ¡£
	*/


	///////////////////////////////////////////////////////////////////////////////
	LYFEXP  BOOL CALLAPI TerminateLock(unsigned long uSerial);
	/*
	*** ¹¦ÄÜËµÃ÷£º
	***		´Ëº¯Êý¶ÔÊÇ¼ÓÃÜËø²»ÔÙÊ¹ÓÃÊ±µ÷ÓÃµÄÖÕÖ¹º¯Êý£¬¶Ô½áÊø¼ÓÃÜËøÊ¹ÓÃ½øÐÐ±ØÒªµÄ²Ù×÷¡£
	***		Õâ¸öº¯Êýµ÷ÓÃºó£¬ÈÎºÎÆäËûÏà¹Øº¯Êý½«²»ÄÜÕý³£Ê¹ÓÃ£¬³ý·ÇÔÙ´Îµ÷ÓÃInitiateLock()º¯Êý¡£
	***
	*** ²ÎÊýËµÃ÷£º
	***		uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆµÄÉè±¸¡£
	***
	*** ·µ»ØÖµ£º
	***		¸Ãº¯ÊýµÄ·µ»ØÖµÈç¹ûÎªTRUEÔòº¯Êý³É¹¦Ö´ÐÐ£¬Èç¹ûÎªFALSE£¬Ôò²Î¿¼´íÎóºÅÁÐ±í¡£Ê¹ÓÃLYFGetLastError()»ñÈ¡´íÎóºÅ¡£
	*/


	//////////////////////////////////////////////////////////////////////////////
	LYFEXP  BOOL CALLAPI Lock32_Function(In long nRandom,
		Out long *puRet,
		In unsigned long uSerial);
	/*
	*** ¹¦ÄÜËµÃ÷£º´Ëº¯Êý¸ù¾ÝÊäÈëµÄ²ÎÊý£¬Í¨¹ý¼ÓÃÜËøµÄÔËËã£¬·µ»ØÒ»¸öÓÐ·ûºÅµÄ32Î»ÕûÊý¡£
	*** ÓëShieldPC()µÄ·µ»ØÖµÏà±È½Ï£¬Èç¹ûÁ½¸ö·µ»ØÖµÏàµÈÔòËµÃ÷¼ÓÃÜËøÄÜ¹»Õý³£¹¤×÷¡£
	***
	*** ²ÎÊýËµÃ÷£º
	*** uRandomNum	£º	Ëæ»úÊý,32Î»ÕûÊý¡£
	*** puRet		£º	»ñÈ¡µ½Ò»¸ö32Î»ÕûÐÎÖµ
	*** uSerial		£º	¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆ¼ÓÃÜËøµÄÉè±¸¡£
	*** 
	*** ·µ»ØÖµ£º
	*** ¸Ãº¯ÊýµÄ·µ»ØÖµÈç¹ûÎªTRUEÔòº¯Êý³É¹¦Ö´ÐÐ£¬Èç¹ûÎªFALSE£¬Ôò²Î¿¼´íÎóºÅÁÐ±í¡£Ê¹ÓÃLYFGetLastError()»ñÈ¡´íÎóºÅ¡£
	*/


	//////////////////////////////////////////////////////////////////////////////
	LYFEXP  BOOL CALLAPI ReadTime(Out time_t *ptTime,
		In const char *pszPsd,
		In unsigned long uSerial,
		In unsigned long uMini);
	/*
	*** ¹¦ÄÜËµÃ÷£º´Ëº¯ÊýÈ¡µÃ¼ÓÃÜËøµÄµ±Ç°Ê±¼ä¡£
	***
	*** ²ÎÊýËµÃ÷£º
	*** ptTime	£º¸Ã²ÎÊýÒÔtime_tµÄÐÎÊ½±íÊ¾£»ÆäÖµÊÇ´ÓUTCÊ±¼ä1970Äê1ÔÂ1ÈÕ00:00:00µ½µ±Ç°Ê±¿ÌµÄÃëÊý¡£
	*** pszPsd	£º¹ÜÀíÃÜÂë»ò¶¯Ì¬ÃÜÂë£¬µ±ÆäÖµÎª¶¯Ì¬ÃÜÂëÊ±£¬uMiniÊÇÓëÖ®¶ÔÓ¦µÄÒ»¸öÖµ¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£¬Èç¹ûpszPsdÊÇ¹ÜÀíÃÜÂë£¬¸ÃÖµ¿ÉÎªÈÎÒâÖµ¡£
	***
	*** ·µ»ØÖµ£º
	*** ¸Ãº¯ÊýµÄ·µ»ØÖµÈç¹ûÎªTRUEÔòº¯Êý³É¹¦Ö´ÐÐ£¬Èç¹ûÎªFALSE£¬Ôò²Î¿¼´íÎóºÅÁÐ±í¡£Ê¹ÓÃLYFGetLastError()»ñÈ¡´íÎóºÅ¡£
	*/


	//////////////////////////////////////////////////////////////////////////////
	LYFEXP  BOOL CALLAPI ResetTime(In const char* pszPsd,
		In unsigned long uSerial,
		In unsigned long uMini);
	/*
	*** ¹¦ÄÜËµÃ÷£º´Ëº¯ÊýÈç¹û³É¹¦Íê³É£¬½«°Ñ¼ÓÃÜËøµÄµ±Ç°Ê±¼äÉèÖÃÎª±¾»úµ±Ç°Ê±¼ä¡£
	*** Ö»ÓÐ¶¯Ì¬ÃÜÂë²ÅÓÐÈ¨ÏÞÖØÐÂÉèÖÃÊ±¼ä¡£ÖØÉèÊ±¼ä¹¦ÄÜÃ¿ÌìÖ»ÄÜÊ¹ÓÃÒ»´Î£¬Ã¿´Î×î¶à½ÃÕýÉÏÏÂ5·ÖÖÓ¡£
	***
	*** ²ÎÊýËµÃ÷£º
	*** pszPsd	£º¶¯Ì¬ÃÜÂë£¬uMiniÊÇÓëÖ®¶ÔÓ¦µÄÒ»¸öÖµ¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ¡£
	***
	*** ·µ»ØÖµ£º
	*** ¸Ãº¯ÊýµÄ·µ»ØÖµÈç¹ûÎªTRUEÔòº¯Êý³É¹¦Ö´ÐÐ£¬Èç¹ûÎªFALSE£¬Ôò²Î¿¼´íÎóºÅÁÐ±í¡£Ê¹ÓÃLYFGetLastError()»ñÈ¡´íÎóºÅ¡£
	*/

	//////////////////////////////////////////////////////////////////////////////
	LYFEXP  BOOL CALLAPI WriteLock(In unsigned long uAddr,
		In const void *Buffer,
		In const char *pszPsd,
		In unsigned long uSerial,
		In unsigned long uMini);
	/*
	*** ¹¦ÄÜËµÃ÷£ºÏò¼ÓÃÜËøµÄ´æ´¢Æ÷ÖÐÐ´ÈëÊý¾Ý£¬¸Ãº¯ÊýÖ»Ð´Èë´Ó»º³åÇøÖ¸ÕëÖ¸ÏòµØÖ·¿ªÊ¼µÄ4×Ö½ÚÊý¾Ý¡£
	***
	*** ²ÎÊýËµÃ÷£º
	*** uAddr	£ºÒªÐ´ÈëµÄÆðÊ¼µØÖ·£¬±ØÐëÎª´Ó1¿ªÊ¼µ½1151
	*** Buffer	£ºÒªÐ´ÈëµÄ»º³åÇøÖ¸Õë¡£
	*** pszPsd	£º¹ÜÀíÃÜÂë»ò¶¯Ì¬ÃÜÂë£¬µ±ÆäÖµÎª¶¯Ì¬ÃÜÂëÊ±£¬uMiniÊÇÓëÖ®¶ÔÓ¦µÄÒ»¸öÖµ¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆµÄÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£¬Èç¹ûpszPsdÊÇ¹ÜÀíÃÜÂë£¬¸ÃÖµ¿ÉÎªÈÎÒâÖµ¡£
	***
	*** ·µ»ØÖµ£º
	*** ¸Ãº¯ÊýµÄ·µ»ØÖµÈç¹ûÎªTRUEÔòº¯Êý³É¹¦Ö´ÐÐ£¬Èç¹ûÎªFALSE£¬Ôò²Î¿¼´íÎóºÅÁÐ±í¡£Ê¹ÓÃLYFGetLastError()»ñÈ¡´íÎóºÅ¡£
	*/

	//////////////////////////////////////////////////////////////////////////////

	LYFEXP  BOOL CALLAPI WriteLockEx(In unsigned long uAddr,
		In const void *Buffer,
		In unsigned long iBufLen,
		In const char *pszPsd,
		In unsigned long uSerial,
		In unsigned long uMini);
	/*
	*** ¹¦ÄÜËµÃ÷£ºÏò¼ÓÃÜËøµÄ´æ´¢Æ÷ÖÐÐ´ÈëÕû¶ÎÊý¾Ý¡£
	***
	*** ²ÎÊýËµÃ÷£º
	*** uAddr	£ºÒªÐ´ÈëµÄÆðÊ¼µØÖ·£¬±ØÐëÎª´Ó1¿ªÊ¼µ½1151¡£
	*** Buffer	£ºÒªÐ´ÈëµÄ»º³åÇøÖ¸Õë¡£
	*** iBufLen	£ºÐ´Èë»º³åÈ¥µÄ³¤¶È¡£
	*** pszPsd	£º¹ÜÀíÃÜÂë»ò¶¯Ì¬ÃÜÂë£¬µ±ÆäÖµÎª¶¯Ì¬ÃÜÂëÊ±£¬uMiniÊÇÓëÖ®¶ÔÓ¦µÄÒ»¸öÖµ¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆ¼ÓÃÜËøµÄÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£¬Èç¹ûpszPsdÊÇ¹ÜÀíÃÜÂë£¬¸ÃÖµ¿ÉÎªÈÎÒâÖµ¡£
	***
	*** ·µ»ØÖµ£º
	*** ¸Ãº¯ÊýµÄ·µ»ØÖµÈç¹ûÎªTRUEÔòº¯Êý³É¹¦Ö´ÐÐ£¬Èç¹ûÎªFALSE£¬Ôò²Î¿¼´íÎóºÅÁÐ±í¡£Ê¹ÓÃLYFGetLastError()»ñÈ¡´íÎóºÅ¡£
	*/

	//////////////////////////////////////////////////////////////////////////////
	LYFEXP  BOOL CALLAPI ReadLock(In unsigned long uAddr,
		In void *pBuffer,
		In const char *pszPsd,
		In unsigned long uSerial,
		In unsigned long uMini);
	/*
	*** ¹¦ÄÜËµÃ÷£º´Ó¼ÓÃÜËøµÄ´æ´¢Æ÷ÖÐ¶Á³öÊý¾Ý£¬¸Ãº¯Êý¶ÁÈ¡´ÓÖ¸¶¨µØÖ·¿ªÊ¼µÄ4×Ö½ÚÊý¾Ý¡£
	***
	*** ²ÎÊýËµÃ÷£º
	*** uAddr	£ºÒª¶ÁÈ¡µÄÆðÊ¼µØÖ·£¬±ØÐëÎª´Ó1¿ªÊ¼µ½1151
	*** Buffer	£ºÒª¶ÁÈ¡µÄ»º³åÇøÖ¸Õë¡£
	*** pszPsd	£º¹ÜÀíÃÜÂë»ò¶¯Ì¬ÃÜÂë£¬µ±ÆäÖµÎª¶¯Ì¬ÃÜÂëÊ±£¬uMiniÊÇÓëÖ®¶ÔÓ¦µÄÒ»¸öÖµ¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆ¼ÓÃÜËøµÄÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£¬Èç¹ûpszPsdÊÇ¹ÜÀíÃÜÂë£¬¸ÃÖµ¿ÉÎªÈÎÒâÖµ¡£
	***
	*** ·µ»ØÖµ£º
	*** ¸Ãº¯ÊýµÄ·µ»ØÖµÈç¹ûÎªTRUEÔòº¯Êý³É¹¦Ö´ÐÐ£¬Èç¹ûÎªFALSE£¬Ôò²Î¿¼´íÎóºÅÁÐ±í¡£Ê¹ÓÃLYFGetLastError()»ñÈ¡´íÎóºÅ¡£
	*/

	//////////////////////////////////////////////////////////////////////////////
	LYFEXP  BOOL CALLAPI ReadLockEx(In unsigned long uAddr,
		In void *pBuffer,
		In unsigned long iReadLen,
		In const char *pszPsd,
		In unsigned long uSerial,
		In unsigned long uMini);
	/*
	*** ¹¦ÄÜËµÃ÷£º´Ó¼ÓÃÜËøµÄ´æ´¢Æ÷ÖÐ¶Á³öÕû¶ÎÊý¾Ý¡£
	***
	*** ²ÎÊýËµÃ÷£º
	*** uAddr	£ºÒª¶ÁÈ¡µÄÆðÊ¼µØÖ·£¬±ØÐëÎª´Ó1¿ªÊ¼µ½1279
	*** Buffer	£ºÒª¶ÁÈ¡µÄ»º³åÇøÖ¸Õë¡£
	*** iReadLen£º¶ÁÈ¡µÄÊý¾Ý³¤¶È
	*** pszPsd	£º¹ÜÀíÃÜÂë»ò¶¯Ì¬ÃÜÂë£¬µ±ÆäÖµÎª¶¯Ì¬ÃÜÂëÊ±£¬uMiniÊÇÓëÖ®¶ÔÓ¦µÄÒ»¸öÖµ¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆ¼ÓÃÜËøµÄÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£¬Èç¹ûpszPsdÊÇ¹ÜÀíÃÜÂë£¬¸ÃÖµ¿ÉÎªÈÎÒâÖµ¡£
	***
	*** ·µ»ØÖµ£º
	*** ¸Ãº¯ÊýµÄ·µ»ØÖµÈç¹ûÎªTRUEÔòº¯Êý³É¹¦Ö´ÐÐ£¬Èç¹ûÎªFALSE£¬Ôò²Î¿¼´íÎóºÅÁÐ±í¡£Ê¹ÓÃLYFGetLastError()»ñÈ¡´íÎóºÅ¡£
	*/

	//////////////////////////////////////////////////////////////////////////////
	LYFEXP  BOOL CALLAPI Counter(In const char *pszPsd,
		In unsigned long uSerial,
		In unsigned long uMini,
		In unsigned long uSign,
		Out unsigned long *uCount);
	/*
	*** ¹¦ÄÜËµÃ÷£º»ñÈ¡¼ÓÃÜËø»¹Òª¶àÉÙ´Îµ½ÆÚ¡£
	***
	*** ²ÎÊýËµÃ÷£º
	*** pszPsd	£º¹ÜÀíÃÜÂë»ò¶ÁÐ´ÃÜÂë£¬Èç¹ûÊÇ¶ÁÐ´ÃÜÂëÊ±£¬Ã¿´Îµ÷ÓÃÊ¹ÓÃ´ÎÊý£¨»òÕßÊ±¼ä£©»á¼õ1¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆ¼ÓÃÜËøµÄÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£¬Èç¹ûpszPsdÊÇ¹ÜÀíÃÜÂë£¬¸ÃÖµ¿ÉÎªÈÎÒâÖµ¡£
	*** uSign	£ºµ½ÆÚÊ±ÊÇ·ñµ¯³ö´°¿ÚÌáÊ¾£¬1Îªµ¯³ö£¬0Îª²»µ¯¡£
	***	uCount	£º³ö²Î£¬ÓÃÀ´»ñÈ¡¼ÓÃÜËø»¹ÓÐ¶àÉÙ´Îµ½ÆÚ¡£
	***
	*** ·µ»ØÖµ£º
	*** ¸Ãº¯ÊýµÄ·µ»ØÖµÈç¹ûÎªTRUEÔòº¯Êý³É¹¦Ö´ÐÐ£¬Èç¹ûÎªFALSE£¬Ôò²Î¿¼´íÎóºÅÁÐ±í¡£Ê¹ÓÃLYFGetLastError()»ñÈ¡´íÎóºÅ¡£
	*/

	//////////////////////////////////////////////////////////////////////////////
	LYFEXP  BOOL CALLAPI SetLock(In unsigned long uFunction,
		In Out unsigned long *puParam,
		In unsigned long uParam,
		In const char *pszParam,
		In const char *pszPsd,
		In unsigned long uSerial,
		In unsigned long uMini);
	/*
	*** ¹¦ÄÜËµÃ÷£º¸Ãº¯ÊýµÄ¹¦ÄÜÊÇÉèÖÃ¼ÓÃÜËø¡£
	***
	*** ²ÎÊýËµÃ÷£º
	*** uFun	£º¹¦ÄÜºÅ
	*** puParam	£ºÓë¹¦ÄÜºÅ¶ÔÓ¦µÄ²ÎÊý
	*** uParam	£ºÓë¹¦ÄÜºÅ¶ÔÓ¦µÄ32Î»ÕûÊý
	*** pszParam£ºÓë¹¦ÄÜºÅ¶ÔÓ¦µÄ²ÎÊý
	*** pszPsd	£º¹ÜÀíÃÜÂë»ò¶¯Ì¬ÃÜÂë£¬µ±ÆäÖµÎª¶¯Ì¬ÃÜÂëÊ±£¬uMiniÊÇÓëÖ®¶ÔÓ¦µÄÒ»¸öÖµ¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆ¼ÓÃÜËøµÄÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£¬Èç¹ûpszPsdÊÇ¹ÜÀíÃÜÂë£¬¸ÃÖµ¿ÉÎªÈÎÒâÖµ¡£

	***----------------------------------------------------------------------------
	*** ¹¦ÄÜºÅ:uFunction = 0 Ê±£ºº¯Êý·µ»Ø¼ÓÃÜËøÊ£ÓàµÄÊ¹ÓÃ´ÎÊý/Ê±¼ä
	*** uFun	£º= 0
	*** puParam	£º·µ»ØÊ£Óà´ÎÊý/·ÖÖÓ
	*** uParam	£ººöÂÔ
	*** pszParam£ººöÂÔ
	*** pszPsd	£º¹ÜÀíÃÜÂë»ò¶¯Ì¬ÃÜÂë£¬µ±ÆäÖµÎª¶¯Ì¬ÃÜÂëÊ±£¬uMiniÊÇÓëÖ®¶ÔÓ¦µÄÒ»¸öÖµ¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆ¼ÓÃÜËøµÄÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£»Èç¹ûpszPsdÊÇ¹ÜÀíÃÜÂë£¬¸ÃÖµºöÂÔ¡£
	***----------------------------------------------------------------------------

	***----------------------------------------------------------------------------
	*** ¹¦ÄÜºÅ:uFunction = 1 Ê±£ºÉèÖÃ¼ÓÃÜËøÆÚÏÞ£¬ÀàÐÍÎª¼Æ´Î
	*** uFun	£º= 1
	*** puParam	£ºÒªÉèÖÃÆÚÏÞµÄ´ÎÊý
	*** uParam	£ººöÂÔ
	*** pszParam£ºÆÚÏÞÃÜÂë
	*** pszPsd	£º¹ÜÀíÃÜÂë»ò¶¯Ì¬ÃÜÂë£¬µ±ÆäÖµÎª¶¯Ì¬ÃÜÂëÊ±£¬uMiniÊÇÓëÖ®¶ÔÓ¦µÄÒ»¸öÖµ¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆ¼ÓÃÜËøµÄÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£»Èç¹ûpszPsdÊÇ¹ÜÀíÃÜÂë£¬¸ÃÖµºöÂÔ¡£
	***----------------------------------------------------------------------------

	***----------------------------------------------------------------------------
	*** ¹¦ÄÜºÅ:uFunction = 2 Ê±£ºÉèÖÃ¼ÓÃÜËøÆÚÏÞ£¬ÀàÐÍÎª¼ÆÊ±ÀàÐÍ£¬¼ÓÃÜËø¿ÉÒÔÓÐÐ§Ê¹ÓÃÊ±¼äÎªÌØ¶¨µÄ·ÖÖÓÊý
	*** uFun	£º= 2
	*** puParam	£ºÒªÉèÖÃÆÚÏÞµÄ·ÖÖÓÊý
	*** uParam	£ººöÂÔ
	*** pszParam£ºÆÚÏÞÃÜÂë
	*** pszPsd	£º¹ÜÀíÃÜÂë»ò¶¯Ì¬ÃÜÂë£¬µ±ÆäÖµÎª¶¯Ì¬ÃÜÂëÊ±£¬uMiniÊÇÓëÖ®¶ÔÓ¦µÄÒ»¸öÖµ¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆ¼ÓÃÜËøµÄÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£»Èç¹ûpszPsdÊÇ¹ÜÀíÃÜÂë£¬¸ÃÖµºöÂÔ¡£
	***----------------------------------------------------------------------------

	***----------------------------------------------------------------------------
	*** ¹¦ÄÜºÅ:uFunction = 3 Ê±£ºÉèÖÃ¼ÓÃÜËøÆÚÏÞ£¬ÀàÐÍÎª¼ÆÊ±ÀàÐÍ£¬¼ÓÃÜËø¿ÉÒÔÓÐÐ§Ê¹ÓÃÖÁ¹Ì¶¨µÄÄ³¸öÊ±¼ä
	*** uFun	£º= 3
	*** puParam	£ºÒªÉèÖÃÆÚÏÞµÄÆðÊ¼Ê±¼ä
	*** uParam	£ºÒªÉèÖÃÆÚÏÞµÄ½áÊøÊ±¼ä
	*** pszParam£ºÆÚÏÞÃÜÂë
	*** pszPsd	£º¹ÜÀíÃÜÂë»ò¶¯Ì¬ÃÜÂë£¬µ±ÆäÖµÎª¶¯Ì¬ÃÜÂëÊ±£¬uMiniÊÇÓëÖ®¶ÔÓ¦µÄÒ»¸öÖµ¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆ¼ÓÃÜËøµÄÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£»Èç¹ûpszPsdÊÇ¹ÜÀíÃÜÂë£¬¸ÃÖµºöÂÔ¡£
	***----------------------------------------------------------------------------

	***----------------------------------------------------------------------------
	*** ¹¦ÄÜºÅ:uFunction = 4 Ê±£ºÓÀ¾Ã½â³ýÊ±¼äÏÞÖÆ£¬»òÖØÐÂÖØÖÃ¼ÓÃÜËøÆÚÏÞ
	*** uFun	£º= 4
	*** puParam	£ººöÂÔ
	*** uParam	£ºµ±Îª¶¯Ì¬ÃÜÂëÊ±ÊäÈëÐèÒªÖØÐÂÉè¶¨µÄÆÚÏÞ£¨±ØÐëÓëÉú³É¶¯Ì¬ÃÜÂëÊäÈëµÄÏàÍ¬£©
	*** pszParam£ºÆÚÏÞÃÜÂë¡£×¢£¬µ±ÆÚÏÞÃÜÂëÕýÈ·´«ÈëÊ±£¬½«ÓÀ¾Ã½â³ýÊ±¼äÏÞÖÆ¡£ÈçÒªÖØÖÃÊ±¼äÏÞÖÆ£¬ÇëºöÂÔ´Ë²ÎÊý¡£
	*** pszPsd	£º¶¯Ì¬ÃÜÂë£¬uMiniÊÇÓëÖ®¶ÔÓ¦µÄÒ»¸öÖµ¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆ¼ÓÃÜËøµÄÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£»Èç¹ûpszParamÒÑ¾­ÊäÈëÕýÈ·µÄÆÚÏÞÃÜÂë£¬¸ÃÖµºöÂÔ¡£
	*** ×¢Òâ	ÊäÈë´íÎó£¬ÐèÒªÎª¼ÓÃÜËø¶Ïµç£¨²å°Î£©£¬²Å¿ÉÒÔÕý³£½â³ý»òÕßÖØÖÃÆÚÏÞ
	***----------------------------------------------------------------------------

	***----------------------------------------------------------------------------
	*** ¹¦ÄÜºÅ:uFunction = 5 Ê±£ºÉèÖÃÏÞÖÆÀàÐÍ
	*** uFun	£º= 5
	*** puParam	£ºÖ¸ÏòµÄÖµÎªLIMIT_TYPE_COUNT±íÊ¾¼Æ´Î¡£LIMIT_TYPE_LENGTH±íÊ¾¼ÆÊ±¡£LIMIT_TYPE_QUANTUM±êÊ¾ÌØ¶¨Ê±¼ä¶Î¡£
	*** uParam	£ººöÂÔ
	*** pszParam£ººöÂÔ
	*** pszPsd	£º¹ÜÀíÃÜÂë»ò¶¯Ì¬ÃÜÂë£¬µ±ÆäÖµÎª¶¯Ì¬ÃÜÂëÊ±£¬uMiniÊÇÓëÖ®¶ÔÓ¦µÄÒ»¸öÖµ¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆ¼ÓÃÜËøµÄÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£»Èç¹ûpszPsdÊÇ¹ÜÀíÃÜÂë£¬¸ÃÖµºöÂÔ¡£
	***----------------------------------------------------------------------------

	***----------------------------------------------------------------------------
	*** ¹¦ÄÜºÅ:uFunction = 6 Ê±£º»ñÈ¡ÏÞÖÆÀàÐÍ
	*** uFun	£º= 6
	*** puParam	£º·µ»Ø¼ÓÃÜËøµ±Ç°ÆÚÏÞÀàÐÍ ÓëÉèÖÃÊ±µÄ¸ÃÖµ¶ÔÓ¦£¬Èç¹û²»ÔÚÕâ3¸öµ±ÖÐ£¬±êÊ¾¼ÓÃÜËø»¹Î´ÉèÖÃÆÚÏÞ¡£
	*** uParam	£ººöÂÔ
	*** pszParam£ººöÂÔ
	*** pszPsd	£º¹ÜÀíÃÜÂë»ò¶¯Ì¬ÃÜÂë£¬µ±ÆäÖµÎª¶¯Ì¬ÃÜÂëÊ±£¬uMiniÊÇÓëÖ®¶ÔÓ¦µÄÒ»¸öÖµ¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆ¼ÓÃÜËøµÄÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£»Èç¹ûpszPsdÊÇ¹ÜÀíÃÜÂë£¬¸ÃÖµºöÂÔ¡£
	***----------------------------------------------------------------------------

	***----------------------------------------------------------------------------
	*** ¹¦ÄÜºÅ:uFunction = 7 Ê±£ºÉèÖÃ¹ÜÀíÃÜÂë
	*** uFun	£º= 7
	*** puParam	£ººöÂÔ
	*** uParam	£ººöÂÔ
	*** pszParam£ºÖ¸ÏòÒªÉèÖÃµÄÃÜÂë×Ö·û´®µÄÖ¸Õë£¬ÃÜÂë³¤¶È×î³¤Îª8¸öÓ¢ÎÄ×ÖÄ¸¡¢Êý×Ö¡¢ÌØÊâ·ûºÅ¡¢µÈ×Ö·û¡£
	*** pszPsd	£º¹ÜÀíÃÜÂë»ò¶¯Ì¬ÃÜÂë£¬µ±ÆäÖµÎª¶¯Ì¬ÃÜÂëÊ±£¬uMiniÊÇÓëÖ®¶ÔÓ¦µÄÒ»¸öÖµ¡£
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆ¼ÓÃÜËøµÄÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£»Èç¹ûpszPsdÊÇ¹ÜÀíÃÜÂë£¬¸ÃÖµºöÂÔ¡£
	***----------------------------------------------------------------------------

	***----------------------------------------------------------------------------
	*** ¹¦ÄÜºÅ:uFunction = 8 Ê±£º»ñÈ¡¼ÓÃÜËøµÄÐòÁÐºÅ
	*** uFun	£º= 8
	*** puParam	£º·µ»Ø¼ÓÃÜËøµÄÐòÁÐºÅ
	*** uParam	£ººöÂÔ
	*** pszParam£ººöÂÔ
	*** pszPsd	£ººöÂÔ
	*** uSerial	£º¼ÓÃÜËøµÄÐòÁÐºÅ£¬±êÊ¾Ò»¸öÌØ¶¨µÄ¼ÓÃÜËø£»Èç¹ûÎª0£¬Ôò±íÊ¾Á¬½Óµ½±¾»úµÄµÚÒ»¸öÀàËÆ¼ÓÃÜËøµÄÉè±¸¡£
	*** uMini	£º¶¯Ì¬ÃÜÂëµÄMiniÖµ£»Èç¹ûpszPsdÊÇ¹ÜÀíÃÜÂë£¬¸ÃÖµºöÂÔ¡£
	***----------------------------------------------------------------------------

	*** ·µ»ØÖµ£º
	*** ¸Ãº¯ÊýµÄ·µ»ØÖµÈç¹ûÎª·Ç0Ôòº¯Êý³É¹¦Ö´ÐÐ£¬Èç¹ûÎª0£¬Ôò²Î¿¼´íÎóºÅÁÐ±í¡£LYFGetLastError()·µ»Ø´íÎóºÅ¡£

	×¢Òâ£ºµ÷ÓÃ´Ëº¯ÊýÊ¹ÓÃÆä²»Í¬¹¦ÄÜÊ±£¬ºöÂÔµÄ²ÎÊý²»ÄÜ´«Èë0£¬NULLµÈÖµ,ÆäËûÈÎÒâÖµ¶¼¿ÉÒÔ¡£
	*/

	///////////////////////////////////////////////////////////////////////////////
	LYFEXP  unsigned long CALLAPI LYFGetLastErr();
	/*
	*** ¹¦ÄÜËµÃ÷£º¸Ãº¯ÊýµÄ¹¦ÄÜÊÇ·µ»Øµ±Ç°Ïß³Ì×îºóÒ»´Î´íÎóµÄ´íÎóºÅ£¬ÓëwindowsµÄGetLastError()º¯Êý·µ»ØµÄÖµ¼æÈÝ
	***			  º¯Êý·µ»ØµÄ´íÎóºÅ¿ÉÔÚ´íÎóÁÐ±íÖÐ²éÕÒ£¬Èç¹û²»ÔÚ´íÎó±íÖÐ£¬ÔòÔÚwindows APIµÄ´íÎóÁÐ±íÖÐ²éÕÒ¡£
	***
	*** ·µ»ØÖµ£º
	*** ¸Ãº¯ÊýµÄ·µ»ØÖµÊÇº¯ÊýµÄ´íÎóºÅ¡£
	*/
	///////////////////////////////////////////////////////////////////////////////

	// CPU SerialNumber
	// comprise 6 WORD nibble, fommatting xxxx-xxxx-xxxx-xxxx-xxxx-xxxx

	struct SerialNumber
	{
		WORD nibble[6];			// 6 WORD nibble;

		SerialNumber()			//constructor
		{
			memset(nibble, 0, sizeof(nibble));
		}
	};

	//ÒÔÏÂËÄ¸öº¯Êý¡£µ±Ö´ÐÐ³É¹¦Ê±·µ»ØTRUE,·ñÔò·µ»ØFALSE;Àý³ÌÎªcdll8test
	LYFEXP BOOL	CALLAPI GetCpuId(SerialNumber &serial);
	/*
	*** ¹¦ÄÜËµÃ÷£º»ñÈ¡µçÄÔµÄcpuid£¬cpuidÊÇ¸öÁù¸ö×Ö£¬96Î»³¤¶ÈµÄ½á¹¹£¬ÀàËÆ£¬xxxx-xxxx-xxxx-xxxx-xxxx-xxxx¡£
	***
	*** ²ÎÊýËµÃ÷£ºSerialNumber : serial;
	ÊÇ¸ö½á¹¹Ìå£¬¶¨ÒåÈçÏÂ£º
	struct SerialNumber
	{
	WORD nibble[6];			// 6 WORD nibble;

	SerialNumber()			//constructor
	{
	memset(nibble, 0, sizeof(nibble));
	}
	};
	ÓÃÓÚ±£´æ»ñµÃµÄcpuid;

	*** ·µ»ØÖµ£º
	*** ¸Ãº¯ÊýµÄ·µ»ØÖµÈç¹ûÎª·Ç0Ôòº¯Êý³É¹¦Ö´ÐÐ£¬Èç¹ûÎª0£¬Ôò»úÆ÷²»Ö§³Öcpuid¡£
	*/
	LYFEXP BOOL	CALLAPI GetMacAddr(BYTE* mac);
	/*
	*** ¹¦ÄÜËµÃ÷£º»ñÈ¡µçÄÔµÄµÚÒ»¸öÍø¿¨µÄmacµØÖ·¡£
	***
	*** ²ÎÊýËµÃ÷£ºBYTE* mac:ÊÇÒ»¸ö6×Ö½ÚµÄÊý×émac[6]; Èç¹ûº¯ÊýÖ´ÐÐ³É¹¦£¬mac»á±£´æÁù¸ö×Ö½ÚµÄmacµØÖ·
	*** ·µ»ØÖµ£º
	*** ¸Ãº¯ÊýµÄ·µ»ØÖµÈç¹ûÎª·Ç0Ôòº¯Êý³É¹¦Ö´ÐÐ£¬Èç¹ûÎª0£¬Ôò²Î¿¼´íÎóºÅÁÐ±í¡£LYFGetLastError()·µ»Ø´íÎóºÅ¡£
	*/
	LYFEXP BOOL	CALLAPI GetHDSerial(char* HardDriveModelNumber);
	/*
	***¹¦ÄÜ£º»ñÈ¡Ó²ÅÌÐòÁÐºÅ
	***²ÎÊý£º¿ÉÒÔÉèÎªchar HardDriveModelNumber[128];
	***·µ»ØÖµ£ºÈç¹û·µ»ØÖµÎª·Ç0Ôòº¯ÊýÖ´ÐÐ³É¹¦£¬·ñÔò²Î¿¼´íÎóºÅÁÐ±í¡£LYFGetLastError()·µ»Ø´íÎóºÅ¡£
	*/
	LYFEXP BOOL	CALLAPI GetVolumNumber(const char* lpRootPathName,DWORD* lpVolumeSerialNumber);
	/*
	***¹¦ÄÜ£º»ñÈ¡Âß¼­´ÅÅÌÐòÁÐºÅ
	***²ÎÊý£ºlpRootPathName£¬Òª»ñÈ¡µÄÂß¼­ÅÌ·û£¬ÈçC:\;
	***	 lpVolumeSerialNumber£¬DWORDÀàÐÍÖ¸Õë£¬±£´æÐòÁÐºÅ
	***·µ»ØÖµ£ºÈç¹û·µ»ØÖµÎª·Ç0Ôòº¯ÊýÖ´ÐÐ³É¹¦£¬·ñÔò²Î¿¼´íÎóºÅÁÐ±í¡£LYFGetLastError()·µ»Ø´íÎóºÅ¡£
	*/

#ifdef __cplusplus
}
#endif



#ifndef _SHIELDPC_H
#define _SHIELDPC_H

/*
*** ¹¦ÄÜËµÃ÷£º
***		´Ëº¯Êý¸ù¾ÝÊäÈëµÄ²ÎÊý·µ»ØÒ»¸öÎÞ·ûºÅµÄ32Î»ÕûÊý¡£ÓëLock32_Function()
***		µÄ·µ»ØÖµÏà±È½Ï£¬Èç¹ûÁ½¸ö·µ»ØÖµÏàµÈÔòËµÃ÷¼ÓÃÜËøÄÜ¹»Õý³£¹¤×÷¡£
***
*** ²ÎÊýËµÃ÷£º
***		nRandom	£º32Î»Ëæ»úÊý¡£
***		key1		£º16Î»µÄKeyÖµ£¬ÐèÒªÓë¼ÓÃÜËøµÄ¶ÔÓ¦ÖµÏàµÈ 0-65535
***		key2		£º16Î»µÄKeyÖµ£¬ÐèÒªÓë¼ÓÃÜËøµÄ¶ÔÓ¦ÖµÏàµÈ 0-65535
***		key3		£º16Î»µÄKeyÖµ£¬ÐèÒªÓë¼ÓÃÜËøµÄ¶ÔÓ¦ÖµÏàµÈ 0-65535
***		key4		£º16Î»µÄKeyÖµ£¬ÐèÒªÓë¼ÓÃÜËøµÄ¶ÔÓ¦ÖµÏàµÈ 0-65535
***
*** ·µ»ØÖµ£º
***		¸Ãº¯Êý·µ»ØÒ»¸ö32Î»ÎÞ·ûºÅÕûÐÎÖµ¡£
*/
static long ShieldPC( long nRandom, unsigned short key1, unsigned short key2, unsigned short key3, unsigned short key4 )
{
	long ReTurnData;

	unsigned short int y,y1,y2,x1,x2,y11,y22;
	unsigned short int outdata1,outdata2;
	//outdata2 = //±£´æXµÄ¸ß16Î»
	outdata2 = (unsigned short int)((nRandom & 0xffff0000) >> 16);
	outdata1 = (unsigned short int)(0xffff & nRandom); //±£´æXµÄµÍ16Î»
	x1=outdata1;
	x2=outdata2;
	y1 = (unsigned short int)(x1 ^ key2);
	y11 = (unsigned short int)(x2 ^ key1);

	y1 = y1 + y11;
	if (y1 > 32767)
		y1 = y1 - 32767;

	y1 = (unsigned short int)(y1 ^ 16) ;
	if (y1 > 32767)
		y1 = y1 - 32767;

	y1 = (unsigned short int)(y1 % key4);
	y = (unsigned short int)(y1 ^ key3);
	if (y > 50000)
		y = y - 50000-1;

	y11 = x1 + key1;
	if (y11 > 32767)
		y11 = y11 - 32767;

	y22 = (unsigned short int)(y11 % key3);
	y11 = (unsigned short int)(key4 ^ x2);
	y2 = y22 ^ y11;

	if (y2 > 50000)
		y2 = y2 - 50000-1;
	y = y ^ y2;

	ReTurnData = y2;

	ReTurnData = ReTurnData << 16; //·µ»ØµÄÊý¾ÝÎªy2ºÍyÆ´³ÉµÄ³¤ÕûÐÍÊý¾Ý
	ReTurnData = ReTurnData ^ y;
	return(ReTurnData);
};

#endif


///////////////////////////////////////////////////////////////////////////////
#endif // __LOCK_H__
